[
    {
        "label": "WWW-Authenticate",
        "value": "WWW-Authenticate",
        "description": "Defines the authentication method that should be used to access a resource."
    },
    {
        "label": "Authorization",
        "value": "Authorization",
        "description": "Contains the credentials to authenticate a user-agent with a server."
    },
    {
        "label": "Proxy-Authenticate",
        "value": "Proxy-Authenticate",
        "description": "Defines the authentication method that should be used to access a resource behind a proxy server."
    },
    {
        "label": "Proxy-Authorization",
        "value": "Proxy-Authorization",
        "description": "Contains the credentials to authenticate a user agent with a proxy server."
    },
    {
        "label": "Age",
        "value": "Age",
        "description": "The time, in seconds, that the object has been in a proxy cache."
    },
    {
        "label": "Cache-Control",
        "value": "Cache-Control",
        "description": "Directives for caching mechanisms in both requests and responses."
    },
    {
        "label": "Clear-Site-Data",
        "value": "Clear-Site-Data",
        "description": "Clears browsing data (e.g. cookies, storage, cache) associated with the requesting website."
    },
    {
        "label": "Expires",
        "value": "Expires",
        "description": "The date/time after which the response is considered stale."
    },
    {
        "label": "Pragma",
        "value": "Pragma",
        "description": "Implementation-specific header that may have various effects anywhere along the request-response chain. Used for backwards compatibility with HTTP/1.0 caches where the Cache-Control header is not yet present."
    },
    {
        "label": "Warning",
        "value": "Warning",
        "description": "General warning information about possible problems."
    },
    {
        "label": "Accept-CH",
        "value": "Accept-CH",
        "description": "Servers can advertise support for Client Hints using the Accept-CH header field or an equivalent HTML <meta> element with http-equiv attribute."
    },
    {
        "label": "Accept-CH-Lifetime",
        "value": "Accept-CH-Lifetime",
        "description": "Servers can ask the client to remember the set of Client Hints that the server supports for a specified period of time, to enable delivery of Client Hints on subsequent requests to the server's origin."
    },
    {
        "label": "Sec-CH-UA",
        "value": "Sec-CH-UA",
        "description": "User agent's branding and version."
    },
    {
        "label": "Sec-CH-UA-Arch",
        "value": "Sec-CH-UA-Arch",
        "description": "User agent's underlying platform architecture."
    },
    {
        "label": "Sec-CH-UA-Bitness",
        "value": "Sec-CH-UA-Bitness",
        "description": "User agent's underlying CPU architecture bitness (for example \"64\" bit)."
    },
    {
        "label": "Sec-CH-UA-Full-Version",
        "value": "Sec-CH-UA-Full-Version",
        "description": "User agent's full semantic version string."
    },
    {
        "label": "Sec-CH-UA-Full-Version-List",
        "value": "Sec-CH-UA-Full-Version-List",
        "description": "Full version for each brand in the user agent's brand list."
    },
    {
        "label": "Sec-CH-UA-Mobile",
        "value": "Sec-CH-UA-Mobile",
        "description": "User agent is running on a mobile device or, more generally, prefers a \"mobile\" user experience."
    },
    {
        "label": "Sec-CH-UA-Model",
        "value": "Sec-CH-UA-Model",
        "description": "User agent's device model."
    },
    {
        "label": "Sec-CH-UA-Platform",
        "value": "Sec-CH-UA-Platform",
        "description": "User agent's underlying operation system/platform."
    },
    {
        "label": "Sec-CH-UA-Platform-Version",
        "value": "Sec-CH-UA-Platform-Version",
        "description": "User agent's underlying operation system version."
    },
    {
        "label": "Content-DPR",
        "value": "Content-DPR",
        "description": "Response header used to confirm the image device to pixel ratio in requests where the DPR client hint was used to select an image resource."
    },
    {
        "label": "Device-Memory",
        "value": "Device-Memory",
        "description": "Approximate amount of available client RAM memory. This is part of the Device Memory API."
    },
    {
        "label": "DPR",
        "value": "DPR",
        "description": "Client device pixel ratio (DPR), which is the number of physical device pixels corresponding to every CSS pixel."
    },
    {
        "label": "Viewport-Width",
        "value": "Viewport-Width",
        "description": "A number that indicates the layout viewport width in CSS pixels. The provided pixel value is a number rounded to the smallest following integer (i.e. ceiling value)."
    },
    {
        "label": "Width",
        "value": "Width",
        "description": "A number that indicates the desired resource width in physical pixels (i.e. intrinsic size of an image)."
    },
    {
        "label": "Downlink",
        "value": "Downlink",
        "description": "Approximate bandwidth of the client's connection to the server, in Mbps. This is part of the Network Information API."
    },
    {
        "label": "ECT",
        "value": "ECT",
        "description": "The effective connection type (\"network profile\") that best matches the connection's latency and bandwidth. This is part of the Network Information API."
    },
    {
        "label": "RTT",
        "value": "RTT",
        "description": "Application layer round trip time (RTT) in milliseconds, which includes the server processing time. This is part of the Network Information API."
    },
    {
        "label": "Save-Data",
        "value": "Save-Data",
        "description": "A boolean that indicates the user agent's preference for reduced data usage."
    },
    {
        "label": "Last-Modified",
        "value": "Last-Modified",
        "description": "The last modification date of the resource, used to compare several versions of the same resource. It is less accurate than ETag, but easier to calculate in some environments. Conditional requests using If-Modified-Since and If-Unmodified-Since use this value to change the behavior of the request."
    },
    {
        "label": "ETag",
        "value": "ETag",
        "description": "A unique string identifying the version of the resource. Conditional requests using If-Match and If-None-Match use this value to change the behavior of the request."
    },
    {
        "label": "If-Match",
        "value": "If-Match",
        "description": "Makes the request conditional, and applies the method only if the stored resource matches one of the given ETags."
    },
    {
        "label": "If-None-Match",
        "value": "If-None-Match",
        "description": "Makes the request conditional, and applies the method only if the stored resource doesn't match any of the given ETags. This is used to update caches (for safe requests), or to prevent uploading a new resource when one already exists."
    },
    {
        "label": "If-Modified-Since",
        "value": "If-Modified-Since",
        "description": "Makes the request conditional, and expects the resource to be transmitted only if it has been modified after the given date. This is used to transmit data only when the cache is out of date."
    },
    {
        "label": "If-Unmodified-Since",
        "value": "If-Unmodified-Since",
        "description": "Makes the request conditional, and expects the resource to be transmitted only if it has not been modified after the given date. This ensures the coherence of a new fragment of a specific range with previous ones, or to implement an optimistic concurrency control system when modifying existing documents."
    },
    {
        "label": "Vary",
        "value": "Vary",
        "description": "Determines how to match request headers to decide whether a cached response can be used rather than requesting a fresh one from the origin server."
    },
    {
        "label": "Connection",
        "value": "Connection",
        "description": "Controls whether the network connection stays open after the current transaction finishes."
    },
    {
        "label": "Keep-Alive",
        "value": "Keep-Alive",
        "description": "Controls how long a persistent connection should stay open."
    },
    {
        "label": "Accept",
        "value": "Accept",
        "description": "Informs the server about the types of data that can be sent back."
    },
    {
        "label": "Accept-Encoding",
        "value": "Accept-Encoding",
        "description": "The encoding algorithm, usually a compression algorithm, that can be used on the resource sent back."
    },
    {
        "label": "Accept-Language",
        "value": "Accept-Language",
        "description": "Informs the server about the human language the server is expected to send back. This is a hint and is not necessarily under the full control of the user: the server should always pay attention not to override an explicit user choice (like selecting a language from a dropdown)."
    },
    {
        "label": "Expect",
        "value": "Expect",
        "description": "Indicates expectations that need to be fulfilled by the server to properly handle the request."
    },
    {
        "label": "Cookie",
        "value": "Cookie",
        "description": "Contains stored HTTP cookies previously sent by the server with the Set-Cookie header."
    },
    {
        "label": "Set-Cookie",
        "value": "Set-Cookie",
        "description": "Send cookies from the server to the user-agent."
    },
    {
        "label": "Access-Control-Allow-Origin",
        "value": "Access-Control-Allow-Origin",
        "description": "Indicates whether the response can be shared."
    },
    {
        "label": "Access-Control-Allow-Credentials",
        "value": "Access-Control-Allow-Credentials",
        "description": "Indicates whether the response to the request can be exposed when the credentials flag is true."
    },
    {
        "label": "Access-Control-Allow-Headers",
        "value": "Access-Control-Allow-Headers",
        "description": "Used in response to a preflight request to indicate which HTTP headers can be used when making the actual request."
    },
    {
        "label": "Access-Control-Allow-Methods",
        "value": "Access-Control-Allow-Methods",
        "description": "Specifies the methods allowed when accessing the resource in response to a preflight request."
    },
    {
        "label": "Access-Control-Expose-Headers",
        "value": "Access-Control-Expose-Headers",
        "description": "Indicates which headers can be exposed as part of the response by listing their names."
    },
    {
        "label": "Access-Control-Max-Age",
        "value": "Access-Control-Max-Age",
        "description": "Indicates how long the results of a preflight request can be cached."
    },
    {
        "label": "Access-Control-Request-Headers",
        "value": "Access-Control-Request-Headers",
        "description": "Used when issuing a preflight request to let the server know which HTTP headers will be used when the actual request is made."
    },
    {
        "label": "Access-Control-Request-Method",
        "value": "Access-Control-Request-Method",
        "description": "Used when issuing a preflight request to let the server know which HTTP method will be used when the actual request is made."
    },
    {
        "label": "Origin",
        "value": "Origin",
        "description": "Indicates where a fetch originates from."
    },
    {
        "label": "Timing-Allow-Origin",
        "value": "Timing-Allow-Origin",
        "description": "Specifies origins that are allowed to see values of attributes retrieved via features of the Resource Timing API, which would otherwise be reported as zero due to cross-origin restrictions."
    },
    {
        "label": "Content-Disposition",
        "value": "Content-Disposition",
        "description": "Indicates if the resource transmitted should be displayed inline (default behavior without the header), or if it should be handled like a download and the browser should present a \"Save As\" dialog."
    },
    {
        "label": "Content-Length",
        "value": "Content-Length",
        "description": "The size of the resource, in decimal number of bytes."
    },
    {
        "label": "Content-Type",
        "value": "Content-Type",
        "description": "Indicates the media type of the resource."
    },
    {
        "label": "Content-Encoding",
        "value": "Content-Encoding",
        "description": "Used to specify the compression algorithm."
    },
    {
        "label": "Content-Language",
        "value": "Content-Language",
        "description": "Describes the human language(s) intended for the audience, so that it allows a user to differentiate according to the users' own preferred language."
    },
    {
        "label": "Content-Location",
        "value": "Content-Location",
        "description": "Indicates an alternate location for the returned data."
    },
    {
        "label": "Forwarded",
        "value": "Forwarded",
        "description": "Contains information from the client-facing side of proxy servers that is altered or lost when a proxy is involved in the path of the request."
    },
    {
        "label": "X-Forwarded-For",
        "value": "X-Forwarded-For",
        "description": "Identifies the originating IP addresses of a client connecting to a web server through an HTTP proxy or a load balancer."
    },
    {
        "label": "X-Forwarded-Host",
        "value": "X-Forwarded-Host",
        "description": "Identifies the original host requested that a client used to connect to your proxy or load balancer."
    },
    {
        "label": "X-Forwarded-Proto",
        "value": "X-Forwarded-Proto",
        "description": "Identifies the protocol (HTTP or HTTPS) that a client used to connect to your proxy or load balancer."
    },
    {
        "label": "Via",
        "value": "Via",
        "description": "Added by proxies, both forward and reverse proxies, and can appear in the request headers and the response headers."
    },
    {
        "label": "Location",
        "value": "Location",
        "description": "Indicates the URL to redirect a page to."
    },
    {
        "label": "From",
        "value": "From",
        "description": "Contains an Internet email address for a human user who controls the requesting user agent."
    },
    {
        "label": "Host",
        "value": "Host",
        "description": "Specifies the domain name of the server (for virtual hosting), and (optionally) the TCP port number on which the server is listening."
    },
    {
        "label": "Referer",
        "value": "Referer",
        "description": "The address of the previous web page from which a link to the currently requested page was followed."
    },
    {
        "label": "Referrer-Policy",
        "value": "Referrer-Policy",
        "description": "Governs which referrer information sent in the Referer header should be included with requests made."
    },
    {
        "label": "User-Agent",
        "value": "User-Agent",
        "description": "Contains a characteristic string that allows the network protocol peers to identify the application type, operating system, software vendor or software version of the requesting software user agent. See also the Firefox user agent string reference."
    },
    {
        "label": "Allow",
        "value": "Allow",
        "description": "Lists the set of HTTP request methods supported by a resource."
    },
    {
        "label": "Server",
        "value": "Server",
        "description": "Contains information about the software used by the origin server to handle the request."
    },
    {
        "label": "Accept-Ranges",
        "value": "Accept-Ranges",
        "description": "Indicates if the server supports range requests, and if so in which unit the range can be expressed."
    },
    {
        "label": "Range",
        "value": "Range",
        "description": "Indicates the part of a document that the server should return."
    },
    {
        "label": "If-Range",
        "value": "If-Range",
        "description": "Creates a conditional range request that is only fulfilled if the given etag or date matches the remote resource. Used to prevent downloading two ranges from incompatible version of the resource."
    },
    {
        "label": "Content-Range",
        "value": "Content-Range",
        "description": "Indicates where in a full body message a partial message belongs."
    },
    {
        "label": "Cross-Origin-Embedder-Policy",
        "value": "Cross-Origin-Embedder-Policy",
        "description": "Allows a server to declare an embedder policy for a given document."
    },
    {
        "label": "Cross-Origin-Opener-Policy",
        "value": "Cross-Origin-Opener-Policy",
        "description": "Prevents other domains from opening/controlling a window."
    },
    {
        "label": "Cross-Origin-Resource-Policy",
        "value": "Cross-Origin-Resource-Policy",
        "description": "Prevents other domains from reading the response of the resources to which this header is applied."
    },
    {
        "label": "Content-Security-Policy",
        "value": "Content-Security-Policy",
        "description": "Controls resources the user agent is allowed to load for a given page."
    },
    {
        "label": "Content-Security-Policy-Report-Only",
        "value": "Content-Security-Policy-Report-Only",
        "description": "Allows web developers to experiment with policies by monitoring, but not enforcing, their effects. These violation reports consist of JSON documents sent via an HTTP POST request to the specified URI."
    },
    {
        "label": "Expect-CT",
        "value": "Expect-CT",
        "description": "Allows sites to opt in to reporting and/or enforcement of Certificate Transparency requirements, which prevents the use of misissued certificates for that site from going unnoticed. When a site enables the Expect-CT header, they are requesting that Chrome check that any certificate for that site appears in public CT logs."
    },
    {
        "label": "Feature-Policy",
        "value": "Feature-Policy",
        "description": "Provides a mechanism to allow and deny the use of browser features in its own frame, and in iframes that it embeds."
    },
    {
        "label": "Origin-Isolation",
        "value": "Origin-Isolation",
        "description": "Provides a mechanism to allow web applications to isolate their origins."
    },
    {
        "label": "Strict-Transport-Security",
        "value": "Strict-Transport-Security",
        "description": "Force communication using HTTPS instead of HTTP."
    },
    {
        "label": "Upgrade-Insecure-Requests",
        "value": "Upgrade-Insecure-Requests",
        "description": "Sends a signal to the server expressing the client's preference for an encrypted and authenticated response, and that it can successfully handle the upgrade-insecure-requests directive."
    },
    {
        "label": "X-Content-Type-Options",
        "value": "X-Content-Type-Options",
        "description": "Disables MIME sniffing and forces browser to use the type given in Content-Type."
    },
    {
        "label": "X-Download-Options",
        "value": "X-Download-Options",
        "description": "The X-Download-Options HTTP header indicates that the browser (Internet Explorer) should not display the option to \"Open\" a file that has been downloaded from an application, to prevent phishing attacks as the file otherwise would gain access to execute in the context of the application. (Note: related MS Edge bug)."
    },
    {
        "label": "X-Frame-Options",
        "value": "X-Frame-Options",
        "description": "Indicates whether a browser should be allowed to render a page in a <frame>, <iframe>, <embed> or <object>."
    },
    {
        "label": "X-Permitted-Cross-Domain-Policies",
        "value": "X-Permitted-Cross-Domain-Policies",
        "description": "Specifies if a cross-domain policy file (crossdomain.xml) is allowed. The file may define a policy to grant clients, such as Adobe's Flash Player (now obsolete), Adobe Acrobat, Microsoft Silverlight (now obsolete), or Apache Flex, permission to handle data across domains that would otherwise be restricted due to the Same-Origin Policy. See the Cross-domain Policy File Specification for more information."
    },
    {
        "label": "X-Powered-By",
        "value": "X-Powered-By",
        "description": "May be set by hosting environments or other frameworks and contains information about them while not providing any usefulness to the application or its visitors. Unset this header to avoid exposing potential vulnerabilities."
    },
    {
        "label": "X-XSS-Protection",
        "value": "X-XSS-Protection",
        "description": "Enables cross-site scripting filtering."
    },
    {
        "label": "Public-Key-Pins",
        "value": "Public-Key-Pins",
        "description": "Associates a specific cryptographic public key with a certain web server to decrease the risk of MITM attacks with forged certificates."
    },
    {
        "label": "Public-Key-Pins-Report-Only",
        "value": "Public-Key-Pins-Report-Only",
        "description": "Sends reports to the report-uri specified in the header and does still allow clients to connect to the server even if the pinning is violated."
    },
    {
        "label": "Sec-Fetch-Site",
        "value": "Sec-Fetch-Site",
        "description": "It is a request header that indicates the relationship between a request initiator's origin and its target's origin. It is a Structured Header whose value is a token with possible values cross-site, same-origin, same-site, and none."
    },
    {
        "label": "Sec-Fetch-Mode",
        "value": "Sec-Fetch-Mode",
        "description": "It is a request header that indicates the request's mode to a server. It is a Structured Header whose value is a token with possible values cors, navigate, no-cors, same-origin, and websocket."
    },
    {
        "label": "Sec-Fetch-User",
        "value": "Sec-Fetch-User",
        "description": "It is a request header that indicates whether or not a navigation request was triggered by user activation. It is a Structured Header whose value is a boolean so possible values are ?0 for false and ?1 for true."
    },
    {
        "label": "Sec-Fetch-Dest",
        "value": "Sec-Fetch-Dest",
        "description": "It is a request header that indicates the request's destination to a server. It is a Structured Header whose value is a token with possible values audio, audioworklet, document, embed, empty, font, image, manifest, object, paintworklet, report, script, serviceworker, sharedworker, style, track, video, worker, and xslt."
    },
    {
        "label": "Service-Worker-Navigation-Preload",
        "value": "Service-Worker-Navigation-Preload",
        "description": "\n      A request header sent in preemptive request to fetch() a resource during service worker boot.\n      The value, which is set with NavigationPreloadManager.setHeaderValue(), can be used to inform a server that a different resource should be returned than in a normal fetch() operation.\n    "
    },
    {
        "label": "NEL",
        "value": "NEL",
        "description": "Defines a mechanism that enables developers to declare a network error reporting policy."
    },
    {
        "label": "Report-To",
        "value": "Report-To",
        "description": "Used to specify a server endpoint for the browser to send warning and error reports to."
    },
    {
        "label": "Transfer-Encoding",
        "value": "Transfer-Encoding",
        "description": "Specifies the form of encoding used to safely transfer the resource to the user."
    },
    {
        "label": "TE",
        "value": "TE",
        "description": "Specifies the transfer encodings the user agent is willing to accept."
    },
    {
        "label": "Trailer",
        "value": "Trailer",
        "description": "Allows the sender to include additional fields at the end of chunked message."
    },
    {
        "label": "Accept-Push-Policy",
        "value": "Accept-Push-Policy",
        "description": "A client can express the desired push policy for a request by sending an Accept-Push-Policy header field in the request."
    },
    {
        "label": "Accept-Signature",
        "value": "Accept-Signature",
        "description": "A client can send the Accept-Signature header field to indicate intention to take advantage of any available signatures and to indicate what kinds of signatures it supports."
    },
    {
        "label": "Alt-Svc",
        "value": "Alt-Svc",
        "description": "Used to list alternate ways to reach this service."
    },
    {
        "label": "Date",
        "value": "Date",
        "description": "Contains the date and time at which the message was originated."
    },
    {
        "label": "Early-Data",
        "value": "Early-Data",
        "description": "Indicates that the request has been conveyed in TLS early data."
    },
    {
        "label": "Large-Allocation",
        "value": "Large-Allocation",
        "description": "Tells the browser that the page being loaded is going to want to perform a large allocation."
    },
    {
        "label": "Link",
        "value": "Link",
        "description": "The Link entity-header field provides a means for serializing one or more links in HTTP headers. It is semantically equivalent to the HTML <link> element."
    },
    {
        "label": "Push-Policy",
        "value": "Push-Policy",
        "description": "A Push-Policy defines the server behavior regarding push when processing a request."
    },
    {
        "label": "Retry-After",
        "value": "Retry-After",
        "description": "Indicates how long the user agent should wait before making a follow-up request."
    },
    {
        "label": "Signature",
        "value": "Signature",
        "description": "The Signature header field conveys a list of signatures for an exchange, each one accompanied by information about how to determine the authority of and refresh that signature."
    },
    {
        "label": "Signed-Headers",
        "value": "Signed-Headers",
        "description": "The Signed-Headers header field identifies an ordered list of response header fields to include in a signature."
    },
    {
        "label": "Server-Timing",
        "value": "Server-Timing",
        "description": "Communicates one or more metrics and descriptions for the given request-response cycle."
    },
    {
        "label": "Service-Worker-Allowed",
        "value": "Service-Worker-Allowed",
        "description": "Used to remove the path restriction by including this header in the response of the Service Worker script."
    },
    {
        "label": "SourceMap",
        "value": "SourceMap",
        "description": "Links generated code to a source map."
    },
    {
        "label": "Upgrade",
        "value": "Upgrade",
        "description": "The relevant RFC document for the Upgrade header field is RFC 7230, section 6.7. The standard establishes rules for upgrading or changing to a different protocol on the current client, server, transport protocol connection. For example, this header standard allows a client to change from HTTP 1.1 to HTTP 2.0, assuming the server decides to acknowledge and implement the Upgrade header field. Neither party is required to accept the terms specified in the Upgrade header field. It can be used in both client and server headers. If the Upgrade header field is specified, then the sender MUST also send the Connection header field with the upgrade option specified. For details on the Connection header field please see section 6.1 of the aforementioned RFC."
    },
    {
        "label": "X-DNS-Prefetch-Control",
        "value": "X-DNS-Prefetch-Control",
        "description": "Controls DNS prefetching, a feature by which browsers proactively perform domain name resolution on both links that the user may choose to follow as well as URLs for items referenced by the document, including images, CSS, JavaScript, and so forth."
    },
    {
        "label": "X-Robots-Tag",
        "value": "X-Robots-Tag",
        "description": "The X-Robots-Tag HTTP header is used to indicate how a web page is to be indexed within public search engine results. The header is effectively equivalent to <meta name=\"robots\" content=\"...\">."
    },
    {
        "label": "X-UA-Compatible",
        "value": "X-UA-Compatible",
        "description": "Used by Internet Explorer to signal which document mode to use."
    }
]
