[
    {
        "label": "100",
        "description": "An interim response. Indicates to the client that the initial part of the request has been received and has not yet been rejected by the server. The client SHOULD continue by sending the remainder of the request or, if the request has already been completed, ignore this response. The server MUST send a final response after the request has been completed."
    },
    {
        "label": "101",
        "description": "Sent in response to an Upgrade request header from the client, and indicates the protocol the server is switching to."
    },
    {
        "label": "102",
        "description": "Indicates that the server has received and is processing the request, but no response is available yet."
    },
    {
        "label": "103",
        "description": "Primarily intended to be used with the Link header. It suggests the user agent start preloading the resources while the server prepares a final response."
    },
    {
        "label": "200",
        "description": "Indicates that the request has succeeded."
    },
    {
        "label": "201",
        "description": "Indicates that the request has succeeded and a new resource has been created as a result."
    },
    {
        "label": "202",
        "description": "Indicates that the request has been received but not completed yet. It is typically used in log running requests and batch processing."
    },
    {
        "label": "203",
        "description": "Indicates that the returned metainformation in the entity-header is not the definitive set as available from the origin server, but is gathered from a local or a third-party copy. The set presented MAY be a subset or superset of the original version."
    },
    {
        "label": "204",
        "description": "The server has fulfilled the request but does not need to return a response body. The server may return the updated meta information."
    },
    {
        "label": "205",
        "description": "Indicates the client to reset the document which sent this request."
    },
    {
        "label": "206",
        "description": "It is used when the Range header is sent from the client to request only part of a resource."
    },
    {
        "label": "207",
        "description": "An indicator to a client that multiple operations happened, and that the status for each operation can be found in the body of the response."
    },
    {
        "label": "208",
        "description": "Allows a client to tell the server that the same resource (with the same binding) was mentioned earlier. It never appears as a true HTTP response code in the status line, and only appears in bodies."
    },
    {
        "label": "226",
        "description": "The server has fulfilled a GET request for the resource, and the response is a representation of the result of one or more instance-manipulations applied to the current instance."
    },
    {
        "label": "300",
        "description": "The request has more than one possible response. The user-agent or user should choose one of them."
    },
    {
        "label": "301",
        "description": "The URL of the requested resource has been changed permanently. The new URL is given by the Location header field in the response. This response is cacheable unless indicated otherwise."
    },
    {
        "label": "302",
        "description": "The URL of the requested resource has been changed temporarily. The new URL is given by the Location field in the response. This response is only cacheable if indicated by a Cache-Control or Expires header field."
    },
    {
        "label": "303",
        "description": "The response can be found under a different URI and SHOULD be retrieved using a GET method on that resource."
    },
    {
        "label": "304",
        "description": "Indicates the client that the response has not been modified, so the client can continue to use the same cached version of the response."
    },
    {
        "label": "305",
        "description": "Indicates that a requested response must be accessed by a proxy."
    },
    {
        "label": "306",
        "description": "It is a reserved status code and is not used anymore."
    },
    {
        "label": "307",
        "description": "Indicates the client to get the requested resource at another URI with same method that was used in the prior request. It is similar to 302 Found with one exception that the same HTTP method will be used that was used in the prior request."
    },
    {
        "label": "308",
        "description": "Indicates that the resource is now permanently located at another URI, specified by the Location header. It is similar to 301 Moved Permanently with one exception that the same HTTP method will be used that was used in the prior request."
    },
    {
        "label": "400",
        "description": "The request could not be understood by the server due to incorrect syntax. The client SHOULD NOT repeat the request without modifications."
    },
    {
        "label": "401",
        "description": "Indicates that the request requires user authentication information. The client MAY repeat the request with a suitable Authorization header field"
    },
    {
        "label": "402",
        "description": "Reserved for future use. It is aimed for using in the digital payment systems."
    },
    {
        "label": "403",
        "description": "Unauthorized request. The client does not have access rights to the content. Unlike 401, the client’s identity is known to the server."
    },
    {
        "label": "404",
        "description": "The server can not find the requested resource."
    },
    {
        "label": "405",
        "description": "The request HTTP method is known by the server but has been disabled and cannot be used for that resource."
    },
    {
        "label": "406",
        "description": "The server doesn’t find any content that conforms to the criteria given by the user agent in the Accept header sent in the request."
    },
    {
        "label": "407",
        "description": "Indicates that the client must first authenticate itself with the proxy."
    },
    {
        "label": "408",
        "description": "Indicates that the server did not receive a complete request from the client within the server’s allotted timeout period."
    },
    {
        "label": "409",
        "description": "The request could not be completed due to a conflict with the current state of the resource."
    },
    {
        "label": "410",
        "description": "The requested resource is no longer available at the server."
    },
    {
        "label": "411",
        "description": "The server refuses to accept the request without a defined Content- Length. The client MAY repeat the request if it adds a valid Content-Length header field."
    },
    {
        "label": "412",
        "description": "The client has indicated preconditions in its headers which the server does not meet."
    },
    {
        "label": "413",
        "description": "Request entity is larger than limits defined by server."
    },
    {
        "label": "414",
        "description": "The URI requested by the client is longer than the server can interpret."
    },
    {
        "label": "415",
        "description": "The media-type in Content-type of the request is not supported by the server."
    },
    {
        "label": "416",
        "description": "The range specified by the Range header field in the request can’t be fulfilled."
    },
    {
        "label": "417",
        "description": "The expectation indicated by the Expect request header field can’t be met by the server."
    },
    {
        "label": "418",
        "description": "It was defined as April’s lool joke and is not expected to be implemented by actual HTTP servers. (RFC 2324)"
    },
    {
        "label": "420",
        "description": "Returned by the Twitter Search and Trends API when the client is being rate limited."
    },
    {
        "label": "422",
        "description": "The server understands the content type and syntax of the request entity, but still server is unable to process the request for some reason."
    },
    {
        "label": "423",
        "description": "The resource that is being accessed is locked."
    },
    {
        "label": "424",
        "description": "The request failed due to failure of a previous request."
    },
    {
        "label": "425",
        "description": "Indicates that the server is unwilling to risk processing a request that might be replayed."
    },
    {
        "label": "426",
        "description": "The server refuses to perform the request. The server will process the request after the client upgrades to a different protocol."
    },
    {
        "label": "428",
        "description": "The origin server requires the request to be conditional."
    },
    {
        "label": "429",
        "description": "The user has sent too many requests in a given amount of time (“rate limiting”)."
    },
    {
        "label": "431",
        "description": "The server is unwilling to process the request because its header fields are too large."
    },
    {
        "label": "444",
        "description": "The Nginx server returns no information to the client and closes the connection."
    },
    {
        "label": "449",
        "description": "The request should be retried after performing the appropriate action."
    },
    {
        "label": "450",
        "description": "Windows Parental Controls are turned on and are blocking access to the given webpage."
    },
    {
        "label": "451",
        "description": "The user-agent requested a resource that cannot legally be provided."
    },
    {
        "label": "499",
        "description": "The connection is closed by the client while HTTP server is processing its request, making the server unable to send the HTTP header back."
    },
    {
        "label": "500",
        "description": "The server encountered an unexpected condition that prevented it from fulfilling the request."
    },
    {
        "label": "501",
        "description": "The HTTP method is not supported by the server and cannot be handled."
    },
    {
        "label": "502",
        "description": "The server got an invalid response while working as a gateway to get the response needed to handle the request."
    },
    {
        "label": "503",
        "description": "The server is not ready to handle the request."
    },
    {
        "label": "504",
        "description": "The server is acting as a gateway and cannot get a response in time for a request."
    },
    {
        "label": "505",
        "description": "The HTTP version used in the request is not supported by the server."
    },
    {
        "label": "506",
        "description": "Indicates that the server has an internal configuration error: the chosen variant resource is configured to engage in transparent content negotiation itself, and is therefore not a proper endpoint in the negotiation process."
    },
    {
        "label": "507",
        "description": "The method could not be performed on the resource because the server is unable to store the representation needed to successfully complete the request."
    },
    {
        "label": "508",
        "description": "The server detected an infinite loop while processing the request."
    },
    {
        "label": "510",
        "description": "Further extensions to the request are required for the server to fulfill it."
    },
    {
        "label": "511",
        "description": "Indicates that the client needs to authenticate to gain network access."
    }
]
